# Ввод данных
Температура = float(input("Введите температуру: "))
Давление = int(input("Введите верхнее давление: "))
Пульс = int(input("Введите пульс: "))

if Температура < 35 or Температура > 38:
    Результат = "Требуется врач"
elif Давление < 105 or Давление > 140:
    Результат = "Требуется врач"
elif Пульс < 55 or Пульс > 110:
    Результат = "Требуется врач"
elif (Температура >= 35 and Температура < 36) or (Температура > 37 and Температура <= 38):
    Результат = "Лёгкое недомогание"
elif (Давление >= 105 and Давление < 110) or (Давление > 130 and Давление <= 140):
    Результат = "Лёгкое недомогание"
elif (Пульс >= 55 and Пульс < 60) or (Пульс > 100 and Пульс <= 110):
    Результат = "Лёгкое недомогание"
else:
    Результат = "Нормальное состояние"
print("Результат:", Результат)
