1.  Хранение текущего количества студентов в группе. # int - целые цифры
2.  Хранение температуры в градусах Цельсия (например, 23.5).# float - цифры с плавающ. точкой
3.  Хранение логина пользователя (например, "ivanov_ivan").# str - текст. строка
4.  Хранение информации о том, включено ли уведомление (да/нет).# bool - true или false
5.  Хранение списка любимых фильмов.# list - список
6.  Хранение координат точки в 2D пространстве (x, y), которые не должны изменяться после задания.# tuple - не измен. после назнач.
7.  Хранение уникальных ID товаров в корзине покупок.# set - уникальность
8.  Хранение соответствия между названием страны и её столицей.# dict - словарь позволяет хран. пары
