# запрос статуса
статус = input("Введите статус заказа: ").lower()

#действия
match статус:
    case "pending":
        print("Статус: В ожидании 🕒")
        print("Описание: Заказ принят и ждет обработки")
        print("Примерное время: 1-2 дня")

    case "processing":
        print("Статус: В обработке ⚙️")
        print("Описание: Заказ собирают на складе")
        print("Примерное время: 1-3 дня")

    case "shipped":
        print("Статус: Отправлено 🚚")
        print("Описание: Ваш заказ находится в пути к вам")
        print("Примерное время: 2-5 дней")

    case "delivered":
        print("Статус: Доставлено 📦")
        print("Описание: Заказ успешно доставлен")
        print("Примерное время: 0 дней")

    case "cancelled":
        print("Статус: Отменено ❌")
        print("Описание: Заказ был отменен")
        print("Примерное время: -")

    # если ошибка
    case _:
        print("Ошибка: Неизвестный статус")
        print("Доступные статусы: pending, processing, shipped, delivered, cancelled")
