# Писал сам, клянусь, есть видео подтверждение, если нужно могу показать

# Лицевая часть
print('\t------Самый лучший магазин "Егорка"------\n\t ---Ниже представлены цены на товары---\n\n')

# Цена разных товаров
prices = [1500, 500, 2000, 3500, 1000, 4500]

# Нахождение максимальной цены
print("-Самый дорогой товар стоит:", max(prices), "руб.\n")

# Нахождение минимальной цены
print("-Самый дешёвый товар:", min(prices), "руб.\n")

# Сумма
print("-Сумма всех товаров:", sum(prices), "руб.\n")

# Средняя цена
sred = sum(prices) / len(prices)

# Вывод информации
print(f"-Средняя цена всех товаров: {sred:,.2f} руб.\n\n")
print("\t------Спасибо за уделённое внимание------")
